//HERC01D  JOB (SETUP),'ALLOC JCL PDS',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//ALLOC    EXEC PGM=IEFBR14
//NEWPDS   DD  DSN=HERC01.JCL,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(15,15,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120,DSORG=PO)
