//HERC01AL JOB (SETUP),'ALLOC RX EXECLIB',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//ALLOC    EXEC PGM=IEFBR14
//NEWPDS   DD  DSN=HERC01.RXBATCH.EXEC,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(5,5,5)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120,DSORG=PO)
