//HERC01B2 JOB (LIST),'PEEK DATE#B',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=BREXX.V2R5M3.JCL(DATE#B),DISP=SHR
//SYSUT2   DD SYSOUT=Z
