//HERC01B  JOB (LIST),'BREXX JCL LIST',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//L1       EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=Z
//DD1      DD UNIT=3390,VOL=SER=TK5002,DISP=OLD
//SYSIN    DD *
  LISTPDS DSNAME=BREXX.V2R5M3.JCL,VOL=3390=TK5002
/*
