//HERC01R  JOB (LIST),'FIND RECVXMIT',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LISTC    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 LISTCAT LEVEL(RECVXMIT) NAMES
/*
