//HERC01M  JOB (LIST),'GCC MEMBERS',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LIST     EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=Z
//DD1      DD UNIT=3390,VOL=SER=TSO001,DISP=OLD
//SYSIN    DD *
  LISTPDS DSNAME=(GCC.PROCLIB,GCC.JCL),VOL=3390=TSO001
/*
