//HERC01P  JOB (LIST),'PEEK GCC JCL',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=GCC.JCL(EXAMPLE),DISP=SHR
//SYSUT2   DD SYSOUT=Z
//P2       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=GCC.PROCLIB(GCCCLG),DISP=SHR
//SYSUT2   DD SYSOUT=Z
