//HERC01V  JOB (LIST),'GCC VOLUMES',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LISTC    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 LISTCAT LEVEL(GCC) VOLUME
 LISTCAT LEVEL(PDPCLIB) VOLUME
 LISTCAT LEVEL(BREXX) VOLUME
 LISTCAT LEVEL(JCC) VOLUME
/*
