//HERC01A  JOB (ASM),'HELLO.ASM',CLASS=A,MSGCLASS=H,REGION=2048K,
//         USER=HERC01,PASSWORD=CUL8TR
//S1       EXEC ASMFCLG
//ASM.SYSPRINT DD SYSOUT=*
//ASM.SYSPUNCH DD DUMMY
//ASM.SYSIN DD DATA,DLM='##'
HELLO    CSECT
         STM   14,12,12(13)      SAVE CALLER REGISTERS
         BALR  12,0              ESTABLISH BASE
         USING *,12
         ST    13,SAVEAREA+4     CHAIN SAVE AREAS
         LA    13,SAVEAREA
         WTO   'HELLO FROM IFOX00 VIA ASM.PS1'
         WTO   'ASSEMBLED, LINKED AND RUN FROM A PC'
         L     13,SAVEAREA+4     RESTORE
         LM    14,12,12(13)
         SR    15,15             RC=0
         BR    14
SAVEAREA DS    18F
         END   HELLO
##
//LKED.SYSPRINT DD SYSOUT=*
//GO.SYSPRINT DD SYSOUT=*
//GO.SYSTERM  DD SYSOUT=*
