//HERC01L  JOB (LIST),'CATALOG SURVEY',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LISTC    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 LISTCAT NAMES
 LISTCAT LEVEL(GCC) NAMES
 LISTCAT LEVEL(GCCMVS) NAMES
 LISTCAT LEVEL(PDPCLIB) NAMES
 LISTCAT LEVEL(SYS2) NAMES
 LISTCAT LEVEL(HERC01) NAMES
/*
