//HERC01K  JOB (LIST),'PDPCLIB CHECK',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LIST     EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=Z
//DD1      DD UNIT=3390,VOL=SER=TSO001,DISP=OLD
//DD2      DD UNIT=3390,VOL=SER=TK5002,DISP=OLD
//SYSIN    DD *
  LISTVTOC VOL=3390=TSO001
  LISTPDS DSNAME=PDPCLIB.MACLIB,VOL=3390=TK5002
  LISTPDS DSNAME=PDPCLIB.MACLIB,VOL=3390=TSO001
/*
