//HERC01K2 JOB (LIST),'PDPCLIB CHECK2',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//LIST     EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=Z
//DD1      DD UNIT=3390,VOL=SER=TSO001,DISP=OLD
//SYSIN    DD *
  LISTPDS DSNAME=(PDPCLIB.SOURCE,GCC.S2),VOL=3390=TSO001
  LISTPDS DSNAME=HERC01.GCCMVS.UNLOAD,VOL=3390=TSO001
/*
