//HERC01T3 JOB (LIST),'PEEK PDPORIG',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=HERC01.PDPCLIB.MACLIB(PDPORIG),DISP=SHR
//SYSUT2   DD SYSOUT=Z
