//HERC01P2 JOB (LIST),'PEEK SYS2 GCCCLG',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=SYS2.PROCLIB(GCCCLG),DISP=SHR
//SYSUT2   DD SYSOUT=Z
