//HERC01Q  JOB (LIST),'PEEK PDPMAC',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBPTPCH
//SYSPRINT DD DUMMY
//SYSUT1   DD DSN=HERC01.GCCMVS.UNLOAD(PDPMAC),DISP=SHR
//SYSUT2   DD SYSOUT=Z
//SYSIN    DD *
  PRINT MAXFLDS=1,STOPAFT=60
  RECORD FIELD=(80)
/*
