//HERC01R3 JOB (LIST),'PEEK RECVXMI',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=RECVXMIT.V0R9M02.CNTL($RECVXMI),DISP=SHR
//SYSUT2   DD SYSOUT=Z
