//HERC01T2 JOB (LIST),'PEEK PDPTOP',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//P1       EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=HERC01.PDPCLIB.MACLIB(PDPTOP),DISP=SHR
//SYSUT2   DD SYSOUT=Z
