//HERC01S  JOB (GCC),'PROMOTE GCC FIX',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//*  STEP 1: PDPCLIB.GCC.MACLIB <- HERC01.PDPCLIB.MACLIB
//COPY     EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=Z
//IN       DD DSN=HERC01.PDPCLIB.MACLIB,DISP=SHR
//OUT      DD DSN=PDPCLIB.GCC.MACLIB,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSALLDA,SPACE=(TRK,(15,5,10)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSUT3   DD UNIT=SYSALLDA,SPACE=(TRK,(5,5))
//SYSIN    DD *
 COPY INDD=IN,OUTDD=OUT
/*
//*  STEP 2: ADD FIXED GCCCLG TO SYS2.PROCLIB
//UPD      EXEC PGM=IEBUPDTE,PARM=MOD,COND=(4,LT,COPY)
//SYSPRINT DD SYSOUT=Z
//SYSUT1   DD DSN=SYS2.PROCLIB,DISP=OLD
//SYSUT2   DD DSN=SYS2.PROCLIB,DISP=OLD
//SYSIN    DD DATA
./ ADD NAME=GCCCLG,LIST=ALL
//GCCCLG  PROC PDPPREF='PDPCLIB',GCCPREF='GCC',INFILE='',
//         COPTS='',LOPTS='MAP,AMODE=31,RMODE=ANY',
// COS1='-S -ansi -pedantic-errors',
// COS2='-o dd:out -'
//* FIXED FOR TK5 02/07/26: IFOX00 (WAS ASMA90), REGION=4096K,
//*   PDPCLIB.GCC.MACLIB IN SYSLIB (HAS PDPMAIN, S370 PDPTOP)
//COMP     EXEC PGM=GCC,COND=(4,LT),REGION=4096K,
// PARM='&COS1 &COPTS &COS2'
//STEPLIB  DD DSN=&GCCPREF..LINKLIB,DISP=SHR
//INCLUDE  DD DSN=&PDPPREF..INCLUDE,DISP=SHR,DCB=BLKSIZE=32720
//SYSINCL  DD DSN=&PDPPREF..INCLUDE,DISP=SHR,DCB=BLKSIZE=32720
//SYSIN    DD DSN=&INFILE,DISP=SHR
//OUT      DD DSN=&&TEMP,DISP=(,PASS),UNIT=SYSALLDA,
//            DCB=(LRECL=80,BLKSIZE=6160,RECFM=FB),
//            SPACE=(6160,(500,500))
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//ASM      EXEC PGM=IFOX00,
//            PARM='DECK,NOLIST',
//            COND=(4,LT,COMP)
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR,DCB=BLKSIZE=32720
//         DD DSN=PDPCLIB.GCC.MACLIB,DISP=SHR
//         DD DSN=&PDPPREF..MACLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSUT2   DD UNIT=SYSALLDA,SPACE=(CYL,(10,10))
//SYSUT3   DD UNIT=SYSALLDA,SPACE=(CYL,(10,10))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DUMMY
//SYSGO    DD DUMMY
//SYSPUNCH DD DSN=&&OBJSET,UNIT=SYSALLDA,SPACE=(80,(200,200)),
//            DISP=(,PASS)
//SYSIN    DD DSN=&&TEMP,DISP=(OLD,DELETE)
//LKED     EXEC PGM=IEWL,PARM='&LOPTS',
//         COND=((4,LT,COMP),(4,LT,ASM))
//SYSLIN   DD DSN=&&OBJSET,DISP=(OLD,DELETE)
//         DD DDNAME=SYSIN
//SYSIN    DD DUMMY
//SYSLIB   DD DSN=&PDPPREF..NCALIB,DISP=SHR
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
//SYSLMOD  DD DSN=&&GOSET(GO),UNIT=SYSALLDA,SPACE=(1024,(50,20,1)),
//   DISP=(MOD,PASS)
//GO       EXEC PGM=*.LKED.SYSLMOD,
//         COND=((4,LT,COMP),(4,LT,ASM),(4,LT,LKED))
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DUMMY
./ ENDUP
/*
