//HERC01R2 JOB (LIST),'PEEK RECV CNTL',CLASS=A,MSGCLASS=Z,
//         USER=HERC01,PASSWORD=CUL8TR
//L1       EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=Z
//DD1      DD UNIT=3390,VOL=SER=TK5001,DISP=OLD
//DD2      DD UNIT=3390,VOL=SER=TK5002,DISP=OLD
//SYSIN    DD *
  LISTPDS DSNAME=RECVXMIT.V0R9M02.CNTL,VOL=3390=TK5001
  LISTPDS DSNAME=RECVXMIT.V0R9M02.CNTL,VOL=3390=TK5002
/*
