//HERC01A  JOB (ASM),'SUMLOOP.ASM',CLASS=A,MSGCLASS=H,REGION=2048K,
//         USER=HERC01,PASSWORD=CUL8TR
//S1       EXEC ASMFCLG
//ASM.SYSPRINT DD SYSOUT=*
//ASM.SYSPUNCH DD DUMMY
//ASM.SYSIN DD DISP=SHR,DSN=HERC01.ASM.SOURCE(SUMLOOP)
//LKED.SYSPRINT DD SYSOUT=*
//GO.SYSPRINT DD SYSOUT=*
//GO.SYSTERM  DD SYSOUT=*
