//HERC01U  JOB (GCC),'UNPACK PDPMAC',CLASS=A,MSGCLASS=Z,REGION=4096K,
//         USER=HERC01,PASSWORD=CUL8TR
//RECV     EXEC PGM=RECV370
//RECVLOG  DD SYSOUT=Z
//XMITIN   DD DSN=HERC01.GCCMVS.UNLOAD(PDPMAC),DISP=SHR
//SYSPRINT DD SYSOUT=Z
//SYSUT1   DD DSN=&&SYSUT1,UNIT=SYSALLDA,SPACE=(CYL,(10,5)),
//            DISP=(,DELETE,DELETE)
//SYSUT2   DD DSN=HERC01.PDPCLIB.MACLIB,DISP=(,CATLG,DELETE),
//            UNIT=SYSALLDA,SPACE=(TRK,(10,5,40))
//SYSIN    DD DUMMY
